#date : 20240129
#desc : 변수설명

# 변수(Variable) - 변하는 수 , 파이썬에서는 들어가는 종류나 크기에 제약이 없음
var01 = 10
print(var01)

var01 = 10000000000000000000000000000000000000000000000000000000
print(var01)


var01 =9999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999
9

print(var01)

var01 = False
print(var01)

var01 = 'Life is short , You need Pyhton'

#eks , qustnauddmf wlwjdtl dkfosms qnfrk
## - 숫자로 시작하거나
## - 공백이 있거나
## - 이외의 특수문자가 있으면

# 단 , 변수명을 지정시 아래는 불가 
## - 숫자로 시작하더나 
## - 공백이 있거나 
## - 이외의 특수문자가 있으면 안됨
#01var = 10 
#var iable = 10 
#var - 01 = 10 
#var @#01 = 10
var_01 = 10 
_var_01=2 #되도록 _ 시작 ㄴㄴ

























